Repository: coolsnowwolf/lede
Catalog: customfeeds/luci/applications/luci-app-minidlna/po/*/minidlna.po
Languages: hu

source: Advanced Settings
hu: Haladó beállítások

source: Album art names:
hu: Borító album nevek:

source: Announced model number:
hu: Közölt modellszám:

source: Announced serial number:
hu: Közölt sorozatszám:

source: Browse directory
hu: Könyvtár tallózása

source: Collecting data...
hu: Adatok gyűjtése...

source: Database directory:
hu: Adatbázis könyvtár:

source: Enable TIVO:
hu: TIVO engedélyezése:

source: Enable inotify:
hu: Inotify engedélyezése:

source: Enable:
hu: Engedélyezés:

source: Friendly name:
hu: Egyéni név:

source: General Settings
hu: Általános beállítások

source: Interfaces:
hu: Interfészek:

source: Log directory:
hu: Napló könyvtár:

source: Media directories:
hu: Média könyvtárak:

source: MiniDLNA is server software with the aim of being fully compliant with DLNA/UPnP-AV clients.
hu: A MiniDLNA egy szerver alkalmazás, ami teljes mértékben kompatibilis a DLNA/UPnP-AV képes kliensekkel.

source: Model number the miniDLNA daemon will report to clients in its XML description.
hu: A miniDLNA által az XML leírásban jelentett modellszám a kliensek számára.

source: Music
hu: Zene

source: Network interfaces to serve.
hu: Kiszolgált hálózati interfészek.

source: Notify interval in seconds.
hu: Értesítés intervalluma másodpercben.

source: Notify interval:
hu: Értesítési intervallum:

source: Pictures
hu: Képek

source: Port for HTTP (descriptions, SOAP, media transfer) traffic.
hu: HTTP forgalom (leírások, SOAP, média átvitel) portja.

source: Presentation URL:
hu: Szolgáltatott URL:

source: Root container:
hu: Gyökér konténer:

source: Serial number the miniDLNA daemon will report to clients in its XML description.
hu: A miniDLNA által az XML leírásban jelentett szériaszám a kliensek számára.

source: Set this if you want to customize the name that shows up on your clients.
hu: Állítsa be, amennyiben a kliensek számára megjelenő nevet szeretné testre szabni.

source: Set this if you would like to specify the directory where you want MiniDLNA to store its database and album art cache.
hu: Állítsa be, ha meg szeretné adni azt könyvtárat, ahová a a MiniDLNA az adatbázisát, illetve az album borító gyorsítótárat rögzítse.

source: Set this if you would like to specify the directory where you want MiniDLNA to store its log file.
hu: Áttítsa be, ha meg szeretné adni azt a könyvtárat, ahová a MiniDLNA a napló állományait mentse.

source: Set this to enable inotify monitoring to automatically discover new files.
hu: Engedélyezze az új fájlok automatikus felfedezéséhez szükséges inotify monitorozáshoz.

source: Set this to enable support for streaming .jpg and .mp3 files to a TiVo supporting HMO.
hu: Engedélyezze a .jpg és .mp3 fájlok közvetítéséhez TiVo támogatott HMO-k felé.

source: Set this to strictly adhere to DLNA standards. This will allow server-side downscaling of very large JPEG images, which may hurt JPEG serving performance on (at least) Sony DLNA products.
hu: Engedélyezze a DLNA követelmények szigorú betartásához. Ez lehetővé teszi a nagyon nagy JPEG képek szerver oldali leméretezését, amik pl. a Sony DLNA termékek JPEG kiszolgáló teljesítményére nincsenek kedvező hatással.

source: Set this to the directory you want scanned. If you want to restrict the directory to a specific content type, you can prepend the type ('A' for audio, 'V' for video, 'P' for images), followed by a comma, to the directory (eg. A,/mnt/media/Music). Multiple directories can be specified.
hu: Állítsa be a vizsgálandó könyvtárra. Ha a könyvtárat egy adott típusú tartalom szerint szeretné korlátozni, akkor a neve előtt vesszővel elválasztva megadhatja a típust ('A' az audió, 'V' a videó, 'P' a képek számára. pl.: A,/mnt/media/Music). Több könyvtár is megadható.

source: Specify the path to the MiniSSDPd socket.
hu: A MiniSSDPd socket elérési útját határozza meg.

source: Standard container
hu: Szabvány konténer

source: Strict to DLNA standard:
hu: DLNA követelmények szigorú betartása:

source: The miniDLNA service is active, serving %d audio, %d video and %d image files.
hu: A miniDLNA szolgáltatás aktív, %d hang, %d videó, %d kép fájl található.

source: The miniDLNA service is not running.
hu: A miniDLNA szolgáltatás nem aktív.

source: This is a list of file names to check for when searching for album art.
hu: Fájlnevek listája, amik ellenőrzésre kerülnek albumborító keresésekor.

source: Video
hu: Videó

source: miniDLNA Status
hu: miniDLNA állapot
