Repository: coolsnowwolf/lede
Catalog: customfeeds/luci/applications/luci-app-simple-adblock/po/*/simple-adblock.po
Languages: ja, pt, ru

source: Blacklisted Domain URLs
ja: ドメイン ブラックリストのURL
pt: Endereço com lista de Domínio para a Lista Negra
ru: URL ссылки Черных<br />списков доменов

source: Blacklisted Domains
ja: ブラックリスト ドメイン
pt: Domínios para a Lista Negra
ru: Черный список доменов

source: Blacklisted Hosts URLs
ja: hosts ブラックリストのURL
pt: Endereços de Hosts para a Lista Negra
ru: URL ссылки Черных<br />списков хостов

source: Controls system log and console output verbosity
ja: システム ログとコンソール出力の冗長性を設定します。
pt: Controla o sistema de registro e o detalhamento das mensagens de saída do console
ru: Детальная настройка записи событий в системный журнал.

source: Force Router DNS
ja: ルーターDNSの強制
pt: Forçar o DNS do Roteador
ru: Назначить DNS роутера

source: Force Router DNS server to all local devices
ja: 全ローカル デバイスにルーター DNSサーバーの使用を強制
pt: Forçar o servidor de DNS do Roteador para todos os dispositivos locais
ru: Назначить DNS роутера всем локальным устройствам

source: Forces Router DNS use on local devices, also known as DNS Hijacking
ja: ローカル デバイスに対し、ルーター上のDNSサーバーの使用を強制します。これは、DNS ハイジャックとしても知られています。
pt: Forçar o uso do DNS do Roteador nos dispositivos locais, também conhecido como redirecionamento de DNS
ru: Назначить DNS роутера всем локальным устройствам, методом DNS Hijacking.

source: Individual domains to be blacklisted
ja: ブラックリストに登録する、個々のドメインです。
pt: Domínios individuais para serem incluídos na Lista Negra
ru: Домены добавленные пользователем в Черный список.

source: Individual domains to be whitelisted
ja: ホワイトリストに登録する、個々のドメインです。
pt: Domínios individuais para serem incluídos na Lista Branca
ru: Домены добавленные пользователем в Белый список.

source: LED to indicate status
ja: ステータスを表示するLED
pt: LED para indicar o estado
ru: LED индикация состояния

source: Let local devices use their own DNS servers if set
ja: DNSサーバーの使用を強制しない
pt: Deixe que os dispositivos locais usem seus próprios servidores de DNS, se definidos
ru: Разрешить локальным устройствам использовать собственные DNS, если они прописаны в настройках сети устройства

source: Output Verbosity Setting
ja: 出力詳細度の設定
pt: Definição do detalhamento do registro
ru: Настройка журнала

source: Pick the LED not already used in
ja: 右の設定で既に使用されていないLEDを選択します
pt: Escolha um LED não usando em
ru: Выберите LED не используется на странице

source: Simple AdBlock Settings
ja: Simple AdBlock 設定
pt: Configuração do Simple AdBlock
ru: Simple AdBlock настройки

source: Some output
ja: 軽量出力
pt: Pouco detalhado
ru: Частичная запись

source: Start Simple Adblock service
ru: Запуск сервиса Simple Adblock

source: Suppress output
ja: 出力の抑制
pt: Suprimir
ru: Запретить запись

source: System LED Configuration
ja: LED 設定
pt: Configuração do LED
ru: 'Настройка LED индикации' системы.

source: URLs to lists of domains to be blacklisted
ja: ブラックリストに登録するドメインのリストのURLです。
pt: Endereço da lista dos domínios para a Lista Negra
ru: URL ссылки Черных списков доменов.

source: URLs to lists of domains to be whitelisted
ja: ホワイトリストに登録するドメインのリストのURLです。
pt: Endereço da lista dos domínios para a Lista Branca
ru: URL ссылки Белых списков доменов.

source: URLs to lists of hosts to be blacklisted
ja: ブラックリストに登録するドメインが列挙された、hostsファイルのURLです。
pt: Endereço da lista dos hosts para a Lista Negra
ru: URL ссылки Черных списков хостов.

source: Verbose output
ja: 詳細出力
pt: Detalhado
ru: Подробная запись

source: Whitelisted Domain URLs
ja: ドメイン ホワイトリストのURL
pt: Endereço com lista de domínio para a Lista Branca
ru: URL ссылки Белых списков доменов

source: Whitelisted Domains
ja: ホワイトリスト ドメイン
pt: Domínios para a Lista Branca
ru: Белый список доменов

source: none
ja: なし
pt: Nenhum
ru: ничего
