Repository: coolsnowwolf/lede
Catalog: customfeeds/luci/applications/luci-app-adblock/po/*/adblock.po
Languages: ru

source: 'Jail' Blocklist Creation
ru: Создание Черного<br />списка 'Jail'

source: Adblock Logfile
ru: Ведение системного журала Adblock-ом

source: Adblock Status
ru: Состояние Adblock-а

source: Adblock Version
ru: Версия Adblock-а

source: Additional trigger delay in seconds before adblock processing begins.
ru: Дополнительная задержка в секундах до начала работы Adblock-a.

source: Advanced
ru: Дополнительно

source: Available blocklist sources.
ru: Источники списков блокировки.

source: Backup Directory
ru: Папка для бэкапа

source: Backup Mode
ru: Режим сохранения бекапа

source: Blocklist Sources
ru: Источники списков блокировки

source: Builds an additional 'Jail' list (/tmp/adb_list.jail) to block access to all domains except those listed in the whitelist file.<br />
ru: Создать дополнительный Черный список 'Jail' (/tmp/adb_list.jail), чтобы заблокировать доступ ко всем доменам, кроме тех что перечислены в файле Белого списка.<br />

source: Caution: To prevent OOM exceptions on low memory devices with less than 64 MB free RAM, please do not select more than five blocklist sources!
ru: ВНИМАНИЕ: Для предотвращения возможного программного сбоя и перезагрузки, на устройствах с объемом оперативной памяти менее 64MB, не выбирайте больше 5 списков.

source: Choose 'none' to disable automatic startups, 'timed' to use a classic timeout (default 30 sec.) or select another trigger interface.
ru: Выберите 'none', чтобы отключить автоматический старт, 'timed', чтобы использовать дефолтную задержку (по умолчанию 30 сек.) или выберите другой интерфейс запуска.

source: Collecting data...
ru: Сбор данных...

source: Configuration of the adblock package to block ad/abuse domains by using DNS.
ru: Настройка Adblock. Приложения для блокировки ненадежных или добавления доверенных доменов используя DNS.

source: Create compressed blocklist backups, they will be used in case of download errors or during startup in backup mode.
ru: Создавайте сжатые резервные копии списков блокировки, они будут использоваться в случае ошибок загрузки или при запуске в ручном режиме.

source: DNS Backend (DNS Directory)
ru: DNS бэкенд (папка DNS)

source: DNS Directory
ru: Папка DNS

source: Description
ru: Описание

source: Do not automatically update blocklists during startup, use blocklist backups instead.
ru: Не обновляйте списки блокировок автоматически во время запуска, вместо этого используйте резервные копии списков блокировок.

source: Download Utility
ru: Скачать утилиту

source: Download Utility (SSL Library)
ru: Загрузить утилиту (библиотека SSL)

source: During opkg package installation use the '--force-maintainer' option to overwrite the pre-existing config file or download a fresh default config from <a href="%s" target="_blank">here</a>
ru: Устанавливая пакет с помощью opkg, используйте '--force-maintainer', чтобы перезаписать существующий config файл или загрузить новый дефолтный config файл <a href="%s" target="_blank">здесь</a>

source: Edit Blacklist
ru: Редактировать Черный список

source: Edit Configuration
ru: Редактировать config файл

source: Edit Whitelist
ru: Редактировать Белый список

source: Email Notification
ru: Уведомление на email

source: Email Notification Count
ru: Кол-во уведомлений на email

source: Enable Adblock
ru: Включить Adblock

source: Enable Blocklist Backup
ru: Включить сохранение<br />списка блокировок

source: Enable memory intense overall sort / duplicate removal on low memory devices (&lt; 64 MB free RAM)
ru: Включите полную сортировку / удаление дубликатов памяти на устройствах с низким объемом памяти (&lt; 64 MB свободной оперативной памяти).

source: Enable verbose debug logging in case of any processing error.
ru: Включите подробное ведение журнала отладки в случае ошибки обработки.

source: Enabled
ru: Включено

source: Extra Options
ru: Дополнительные настройки

source: Flush DNS Cache
ru: Очистка кэша DNS

source: Flush DNS Cache after adblock processing.
ru: Очистки DNS-кэша после обработки Adblock-ом.

source: For SSL protected blocklist sources you need a suitable SSL library, e.g. 'libustream-ssl' or 'built-in'.
ru: Для SSL-защищенных источников списков блокировки, вам нужны подходящие SSL библиотеки, например 'libustream-ssl' или 'built-in'.

source: For further information <a href="%s" target="_blank">check the online documentation</a>
ru: <br />Для получения дополнительной информации <a href="%s" target="_blank"> смотрите онлайн документацию</a>.

source: For further performance improvements you can raise this value, e.g. '8' or '16' should be safe.
ru: Для повышения производительности вы можете увеличить это значение, например значения '8' или '16' повысят безопасность.

source: Force Local DNS
ru: Назначить локальный DNS

source: Force Overall Sort
ru: Назначить полную сортировку

source: Full path to the whitelist file.
ru: Полный путь к файлу Белого списка.

source: Input file not found, please check your configuration.
ru: Config файл не найден, настройте config файл.

source: Invalid domain specified!
ru: Задан недопустимый домен!

source: Last Run
ru: Последнее время запуска

source: List URLs and Shallalist category selections are configurable in the 'Advanced' section.<br />
ru: Список URL-адресов и настройка списка использования, настраиваются на странице 'Дополнительно'.<br />

source: List of available network interfaces. Usually the startup will be triggered by the 'wan' interface.<br />
ru: Список доступных сетевых интерфейсов. По умолчанию установлен 'wan' интерфейс.<br />

source: List of supported DNS backends with their default list export directory.<br />
ru: Список поддерживаемых серверов DNS перемещается в папку по умолчанию.<br />

source: List of supported and fully pre-configured download utilities.
ru: Список поддерживаемых и полностью предварительно настроенных утилит загрузки.

source: Loading
ru: Загрузка

source: Max. Download Queue
ru: Максимальное значение очереди загрузки

source: No
ru: Нет

source: Options for further tweaking in case the defaults are not suitable for you.
ru: Возможные варианты детальной настройки, если значения по умолчанию не подходят для вас.

source: Overall Domains
ru: Итоговые домены

source: Overview
ru: Главное меню

source: Please add only one domain per line. Comments introduced with '#' are allowed - ip addresses, wildcards and regex are not.
ru: Добавляйте только один домен в строке. Комментарии вводятся используя '#' разрешенные - ip адреса, метасимволы и нерегулярные выражения.

source: Please edit this file directly in a terminal session.
ru: Отредактируйте данный файл, строго в терминале.

source: Please note: this needs additional 'msmtp' package installation and setup.
ru: Внимание: это потребует дополнительной установки пакета 'msmtp'.

source: Please update your adblock config file to use this package.<br />
ru: Обновите config файл Adblock, чтобы использовать этот пакет.<br />

source: Query
ru: Запрос

source: Query domains
ru: Запрос доменов

source: Raise the minimum email notification count, to get emails if the overall count is less or equal to the given limit (default 0),<br />
ru: Увеличьте количество уведомлений по email, чтобы получить сообщения, если общее количество меньше или равно заданному пределу (по умолчанию 0),<br />

source: Redirect all DNS queries from 'lan' zone to the local resolver.
ru: Перенаправлять все DNS запросы с интерфейса 'lan' на обработку Adblock-ом.

source: Resume
ru: Возобновить

source: Runtime Information
ru: Информация о состоянии

source: SSL req.
ru: Запрос SSL

source: Save
ru: Сохранить

source: Send notification emails in case of a processing error or if domain count is &le; 0.<br />
ru: Отправлять по email уведомления в случае ошибки обработки или если домен &le; 0.<br />

source: Size of the download queue to handle downloads &amp; list processing in parallel (default '4').<br />
ru: Значение очереди загрузки для выполнения параллельных загрузок (по умолчанию '4').<br />

source: Startup Trigger
ru: Назначить

source: Suspend
ru: Приостановить

source: Suspend / Resume Adblock
ru: Приостановить / Возобновить Adblock

source: Target directory for adblock backups. Please use only non-volatile disks, e.g. an external usb stick.
ru: Назначить папку для резервного копирования Adblock. Используйте такие накопители, как usb флешка.

source: Target directory for the generated blocklist 'adb_list.overall'.
ru: Назначить папку для создания списка блокировки 'adb_list.overall'.

source: The file size is too large for online editing in LuCI (&gt; 512 KB).
ru: Размер файла слишком большой, для онлайн редактирования в LuCI (&gt; 512 KB).

source: This form allows you to modify the content of the adblock blacklist (%s).<br />
ru: Страница позволяет изменять содержимое Черного списка Adblock (%s).<br />

source: This form allows you to modify the content of the adblock whitelist (%s).<br />
ru: Страница позволяет изменять содержимое Белого списка Adblock (%s).<br />

source: This form allows you to modify the content of the main adblock configuration file (/etc/config/adblock).
ru: Страница позволяет изменять содержимое главного config файла Adblock-a (/etc/config/adblock).

source: This form allows you to query active block lists for certain domains, e.g. for whitelisting.
ru: Страница позволяет запросить домены для конкретных списков, например для Белого списка.

source: This form shows the syslog output, pre-filtered for adblock related messages only.
ru: Страница системного журнала. Только сообщения связанные с Adblock.

source: This section contains no values yet
ru: Здесь не содержатся необходимые значения

source: To overwrite the default path use the 'DNS Directory' option in the extra section below.
ru: Чтобы заменить дефолтный путь, используйте строку ниже 'Папка DNS' в разделе 'Дополнительные настройки'.

source: Trigger Delay
ru: Задержка запуска

source: Verbose Debug Logging
ru: Подробное ведение<br />журнала отладки

source: View Logfile
ru: Показать системный журнал

source: Waiting for command to complete...
ru: Ожидание завершения выполнения команды...

source: Whitelist File
ru: Файл Белого списка

source: Yes
ru: Да

source: You can use this restrictive blocklist manually e.g. for guest wifi or kidsafe configurations.
ru: Вы можете вручную настраивать и использовать этот Черный список, например для гостевой wifi сети или режима родительского контроля.

source: disabled
ru: отключено

source: e.g. to receive an email notification with every adblock update set this value to 150000.
ru: например, чтобы получать уведомления по электронной почте при каждом обновлении Adblock-а установите значение 150000.

source: enabled
ru: включено

source: error
ru: ошибка

source: n/a
ru: нет данных

source: paused
ru: остановлено

source: running
ru: работает
