Repository: coolsnowwolf/lede
Catalog: customfeeds/luci/applications/luci-app-ahcp/po/*/ahcp.po
Languages: ca

source: AHCP Server
ca: Servidor AHCP

source: Active AHCP Leases
ca: Leases actius d'AHCP

source: Address
ca: Adreça

source: Advanced Settings
ca: Configuració avançada

source: Age
ca: Edat

source: Announced DNS servers
ca: Servidors DNS anunciats

source: Announced NTP servers
ca: Servidors NTP anunciats

source: Announced prefixes
ca: Prefixos anunciats

source: Collecting data...
ca: Recopilant informació...

source: Forwarder
ca: Retransmissor

source: General Setup
ca: Configuració general

source: IPv4 and IPv6
ca: IPv4 i IPv6

source: IPv4 only
ca: Només IPv4

source: IPv6 only
ca: Només IPv6

source: Lease directory
ca: Directori d'arrendament

source: Lease validity time
ca: Duració d'arrendament

source: Log file
ca: Fitxer de registre

source: Multicast address
ca: Adreça de difusió selectiva

source: Operation mode
ca: Mode d'operació

source: Protocol family
ca: Família de protocol

source: Served interfaces
ca: Interfícies servides

source: Server
ca: Servidor

source: Specifies the announced IPv4 and IPv6 NTP servers
ca: Especifica els servidors NTP IPv4 i IPv6 anunciats

source: Specifies the announced IPv4 and IPv6 name servers
ca: Especifica els servidors de noms IPv4 i IPv6 anunciats

source: Specifies the announced IPv4 and IPv6 network prefixes in CIDR notation
ca: Especifica els prefixos de xarxa IPv4 i IPv6 anunciats en notació CIDR

source: The AHCP Service is not running.
ca: El servidor AHCP no està funcionant.

source: The AHCP Service is running with ID %s.
ca: El servei AHCP està funcionant amb el ID %s.

source: There are no active leases.
ca: No hi ha arrendaments actius.

source: Unique ID file
ca: Fitxer ID únic
