Repository: coolsnowwolf/lede
Catalog: customfeeds/luci/applications/luci-app-firewall/po/*/firewall.po
Languages: es, uk, zh_tw

source: %s in %s
es: %s en %s
uk: %s у %s
zh_tw: %s 位於 %s

source: %s%s with %s
es: %s%s con %s
uk: %s%s із %s
zh_tw: %s%s 和 %s

source: %s, %s in %s
es: %s, %s en %s
uk: %s, %s у %s
zh_tw: %s, %s 位於 %s

source: (Unnamed Entry)
es: (Entrada sin nombre)
uk: (Запис без імені)
zh_tw: （未命名條目）

source: (Unnamed Rule)
es: (Reglas sin nombre)
uk: (Правило без імені)
zh_tw: （未命名規則）

source: (Unnamed SNAT)
es: (SNAT sin nombre)
uk: (SNAT без імені)
zh_tw: （未命名 SNAT）

source: <var>%d</var> pkts. per <var>%s</var>
es: <var>%d</var> paquetes por <var>%s</var>
uk: <var>%d</var> пакетів за <var>%s</var>
zh_tw: <var>%d</var> 資料包。每 <var>%s</var>

source: <var>%d</var> pkts. per <var>%s</var>, burst <var>%d</var> pkts.
es: <var>%d</var> paquetes por <var>%s</var>, máximo <var>%d</var> paquetes.
uk: <var>%d</var> пакетів за <var>%s</var>, підряд <var>%d</var> пакетів
zh_tw: <var>%d</var> 資料包。每 <var>%s</var>，突發 <var>%d</var> 資料包。

source: <var>%s</var> and limit to %s
es: <var>%s</var> y límite a %s
uk: <var>%s</var> з лімітом %s
zh_tw: <var>%s</var> 並限制到 %s

source: Action
es: Acción
uk: Дія
zh_tw: 動作

source: Add
es: Añadir
uk: Додати
zh_tw: 新增

source: Add and edit...
es: Añadir y editar...
uk: Додати та редагувати...
zh_tw: 新增並編輯...

source: Advanced Settings
es: Configuración avanzada
uk: Розширені настройки
zh_tw: 高階設定

source: Allow forward from <em>source zones</em>:
es: Permitir traspaso desde <em>zonas de origen</em>:
uk: Дозволити спрямовування від <em>зон-джерел</em>:
zh_tw: 允許從<em>源區域</em>轉發：

source: Allow forward to <em>destination zones</em>:
es: Permitir traspaso a <em>zonas de destino</em>:
uk: Дозволити спрямовування до <em>зон призначення</em>:
zh_tw: 允許轉發到<em>目標區域</em>：

source: Any
es: Cualquiera
uk: Будь-який
zh_tw: 任何

source: Covered networks
es: Redes cubiertas
uk: Покриті мережі
zh_tw: 覆蓋網路

source: Custom Rules
es: Reglas propias
uk: Настроювані правила
zh_tw: 自定義規則

source: Custom rules allow you to execute arbitrary iptables commands which are not otherwise covered by the firewall framework. The commands are executed after each firewall restart, right after the default ruleset has been loaded.
es: Las reglas propias le permiten ejecutar comandos de iptables que no están disponibles en el marco del cortafuegos. Los comandos se ejecutarán tras cualquier rearranque del cortafuegos, justo tras haber cargado el conjunto de reglas por defecto.
uk: Настроювані правила дозволяють виконувати довільні команди <em>iptables</em>, які в іншому випадку не охоплені в межах брандмауера. Команди виконуються після кожного перезавантаження брандмауера, відразу після завантаження типового набору правил.
zh_tw: 自定義規則允許您執行不屬於防火牆框架的任意 iptables 命令。每次重啟防火牆時，在預設的規則執行後這些命令將立即執行。

source: Destination IP address
es: Dirección IP destino
uk: IP-адреса призначення
zh_tw: 目標 IP 位址

source: Destination address
es: Dirección de destino
uk: Адреса призначення
zh_tw: 目標位址

source: Destination port
es: Puerto de destino
uk: Порт призначення
zh_tw: 目標埠

source: Destination zone
es: Zona de destino
uk: Зона призначення
zh_tw: 目標區域

source: Do not rewrite
es: No reescribir
uk: Не перезаписувати
zh_tw: 不重寫

source: Drop invalid packets
es: Descartar paquetes no válidos
uk: Відкидати помилкові пакети
zh_tw: 丟棄無效資料包

source: Enable
es: Activar
uk: Увімкнути
zh_tw: 啟用

source: Enable NAT Loopback
es: Activar bucle NAT
uk: Увімкнути NAT Loopback
zh_tw: 啟用 NAT 環回

source: Enable SYN-flood protection
es: Activar protección a inundación-SYN
uk: Увімкнути захист від SYN-flood
zh_tw: 啟用 SYN-flood 防禦

source: Enable logging on this zone
es: Activar registro en esta zona
uk: Увімкнути реєстрування у цій зоні
zh_tw: 啟用此區域的日誌記錄

source: External IP address
es: Dirección IP externa
uk: Зовнішня IP-адреса
zh_tw: 外部 IP 位址

source: External port
es: Puerto externo
uk: Зовнішній порт
zh_tw: 外部埠

source: External zone
es: Zona externa
uk: Зовнішня зона
zh_tw: 外部區域

source: Extra arguments
es: Parámetros extra
uk: Додаткові аргументи
zh_tw: 附加引數

source: Firewall
es: Cortafuegos
uk: Брандмауер
zh_tw: 防火牆

source: Firewall - Custom Rules
es: Cortafuegos - Reglas propias
uk: Брандмауер — Настроювані правила
zh_tw: 防火牆 - 自定義規則

source: Firewall - Port Forwards
es: Cortafuegos - traspasos de puerto
uk: Брандмауер — Спрямовування портів
zh_tw: 防火牆 - 埠轉發

source: Firewall - Traffic Rules
es: Cortafuegos - Reglas de tráfico
uk: Брандмауер — Правила трафіка
zh_tw: 防火牆 - 通訊規則

source: Firewall - Zone Settings
es: Cortafuegos - Configuración de la zona
uk: Брандмауер — Параметри зон
zh_tw: 防火牆 - 區域設定

source: Force connection tracking
es: Forzar seguimiento de conexión
uk: Увімкнути відстеження з'єднань
zh_tw: 強制連線追蹤

source: Forward
es: Traspasar
uk: Спрямовування
zh_tw: 轉發

source: Forward to
es: Traspasar a
uk: спрямовування до
zh_tw: 轉發到

source: Friday
zh_tw: 星期五

source: From %s in %s
es: Desde %s en %s
uk: %s у %s
zh_tw: 來自 %s 位於 %s

source: From %s in %s with source %s
es: Desde %s en %s con origen %s
uk: %s у %s з вихідним %s
zh_tw: 來自 %s 位於 %s 源於 %s

source: From %s in %s with source %s and %s
es: Desde %s en %s con origen %s y %s
uk: %s у %s з вихідним %s та %s
zh_tw: 來自 %s 位於 %s 源埠 %s 源 MAC %s

source: General Settings
es: Configuración general
uk: Загальні настройки
zh_tw: 基本設定

source: IPv4 and IPv6
es: IPv4 e IPv6
uk: IPv4 та IPv6
zh_tw: IPv4 和 IPv6

source: IPv4 only
es: Sólo IPv4
uk: Лише IPv4
zh_tw: 僅 IPv4

source: IPv6 only
es: Sñolo IPv6
uk: Лише IPv6
zh_tw: 僅 IPv6

source: Input
es: Entrada
uk: Вхідний
zh_tw: 入站資料

source: Inter-Zone Forwarding
es: Traspaso entre zonas
uk: Спрямовування крізь зони
zh_tw: 埠觸發

source: Internal IP address
es: Dirección IP interna
uk: Внутрішня IP-адреса
zh_tw: 內部 IP 位址

source: Internal port
es: Puerto interno
uk: Внутрішній порт
zh_tw: 內部埠

source: Internal zone
es: Zona interna
uk: Внутрішня зона
zh_tw: 內部區域

source: Limit log messages
es: Limitar registro de mensajes
uk: Обмеження повідомлень журналу
zh_tw: 限制日誌資訊

source: MSS clamping
es: Fijado de MSS
uk: Затискання MSS
zh_tw: MSS 鉗制

source: Masquerading
es: Enmascaramiento
uk: Підміна
zh_tw: IP 動態偽裝

source: Match
es: Coincidir
uk: Зіставляти
zh_tw: 匹配規則

source: Match ICMP type
es: Coincidir con tipo ICMP
uk: Зіставляти ICMP типу
zh_tw: 匹配 ICMP 型別

source: Match forwarded traffic to the given destination port or port range.
es: Coincidir con tráfico traspasado al puerto o rango de puertos destino.
uk: Зіставляти трафік, що спрямовується на заданий порт призначення або діапазон портів.
zh_tw: 匹配指定目標埠或目標埠範圍的轉發流量。

source: Match incoming traffic directed at the given destination port or port range on this host
es: Coincidir con tráfico de entrada dirigido al puerto o rango de puertos destino en esta máquina
uk: Зіставляти вхідний трафік, спрямований на заданий порт призначення або діапазон портів цього вузла.
zh_tw: 匹配指向此主機上指定目標埠或目標埠範圍的入站流量。

source: Match incoming traffic originating from the given source port or port range on the client host.
es: Coincidir con tráfico de entrada originado desde el puerto o rango de puertos origen en la máquina cliente.
uk: Зіставляти вхідний трафік, що виникає на заданому порту джерела або діапазоні портів вузла клієнта.
zh_tw: 匹配來自客戶端主機上指定源埠或源埠範圍的入站流量。

source: Monday
zh_tw: 星期一

source: Month Days
zh_tw: 日期

source: Name
es: Nombre
uk: Ім'я
zh_tw: 名字

source: New SNAT rule
es: Nueva regla SNAT
uk: Нове правило SNAT
zh_tw: 新建 SNAT 規則

source: New forward rule
es: Nueva regla de traspaso
uk: Нове правило спрямовування
zh_tw: 新建轉發規則

source: New input rule
es: Nueva regla de entrada
uk: Нове вхідне правило
zh_tw: 新建進入規則

source: New port forward
es: Nuevo traspaso de puerto
uk: Нове спрямовування порту
zh_tw: 新建埠轉發

source: New source NAT
es: Nuevo origen NAT
uk: Новий NAT джерела
zh_tw: 新建 Source NAT

source: Only match incoming traffic directed at the given IP address.
es: Coincidir sólo con tráfico de entrada a esta dirección IP.
uk: Зіставляти тільки вхідний трафік, спрямований на задану IP-адресу.
zh_tw: 僅匹配指定目的 IP 位址的入站流量。

source: Only match incoming traffic from these MACs.
es: Coincidir sólo con tráfico de entrada desde estas MACs.
uk: Зіставляти тільки вхідний трафік від цих MAC-адрес.
zh_tw: 僅匹配來自這些 MAC 的入站流量。

source: Only match incoming traffic from this IP or range.
es: Coincidir sólo con tráfico de entrada desde esta IP o rango.
uk: Зіставляти тільки вхідний трафік від цього IP чи діапазону.
zh_tw: 僅匹配來自此 IP 或 IP 範圍的入站流量。

source: Only match incoming traffic originating from the given source port or port range on the client host
es: Coincidir sólo con tráfico de entrada originado desde el puerto o rango de puertos origen en la máquina cliente
uk: Зіставляти тільки вхідний трафік, що виникає на заданому порту джерела або діапазоні портів вузла клієнта.
zh_tw: 僅匹配源自客戶端主機上給定源埠或源埠範圍的入站流量。

source: Open ports on router
es: Abrir puertos en el router
uk: Відкрити порти на роутері
zh_tw: 開啟路由器埠

source: Other...
es: Otros...
uk: Інше...
zh_tw: 其它...

source: Output
es: Salida
uk: Вихідний
zh_tw: 出站資料

source: Passes additional arguments to iptables. Use with care!
es: Pasa más parámetros a IPTables. ¡Usar con cuidado!
uk: Передача додаткових аргументів для IPTables. Використовуйте з обережністю!
zh_tw: 傳遞到 iptables 的額外引數。小心使用！

source: Port Forwards
es: Traspasos de puerto
uk: Спрямовування портів
zh_tw: 埠轉發

source: Port forwarding allows remote computers on the Internet to connect to a specific computer or service within the private LAN.
es: El traspaso de puertos permite a ordenadores remotos en internet conectar a un ordenador o servicio específico en la LAN privada.
uk: Спрямовування портів дозволяє віддаленим комп'ютерам з Інтернету підключатися до певного комп'ютера або служби у приватній мережі.
zh_tw: 埠轉發允許 Internet 上的遠端計算機連線到內部網路中的特定計算機或服務。

source: Protocol
es: Protocolo
uk: Протокол
zh_tw: 協議

source: Redirect matched incoming traffic to the given port on the internal host
es: Redirigir el tráfico de entrada que coincida al puerto en la máquina interna
uk: Переспрямувати відповідний вхідний трафік на заданий порт внутрішнього вузла
zh_tw: 重定向匹配的入站流量到內部主機的埠

source: Redirect matched incoming traffic to the specified internal host
es: Redirigir el tráfico de entrada que coincida a la máquina interna
uk: Переспрямувати відповідний вхідний трафік на заданий внутрішній вузол
zh_tw: 重定向匹配的入站流量到指定的內部主機

source: Restart Firewall
zh_tw: 重啟防火牆

source: Restrict Masquerading to given destination subnets
es: Restringir enmascaramiento a las subredes destino
uk: Обмежити підміну заданими підмережами призначення
zh_tw: 要限制 IP 動態偽裝的目標子網

source: Restrict Masquerading to given source subnets
es: Restringir enmascaramiento a las subredes origen
uk: Обмежити підміну заданими вихідними підмережами
zh_tw: 要限制 IP 動態偽裝的源子網

source: Restrict to address family
es: Restringir a la familia de direcciones
uk: Обмежити сімейство протоколів
zh_tw: 限制位址

source: Rewrite matched traffic to the given address.
es: Reescribir el tráfico que coincida a estas direcciones.
uk: Переписувати зіставлений трафік на вказану адресу.
zh_tw: 將匹配流量的源位址改寫成指定位址。

source: Rewrite matched traffic to the given source port. May be left empty to only rewrite the IP address.
es: Reescribir el tráfico que coincida con este puerto origen. Deje en blanco para reescribir sólo la dirección IP.
uk: Переписувати зіставлений трафік на вказаний порт джерела. Може залишатися порожнім, щоб переписувати тільки IP-адресу.
zh_tw: 將匹配流量的源埠改寫成指定埠。留空只改寫 IP 位址。

source: Rewrite to source %s
es: Reescribir a origen %s
uk: перезапис на вихідний %s
zh_tw: 源位址改寫成 %s

source: Rewrite to source %s, %s
es: Reescribir a origen %s, %s
uk: перезапис на вихідний %s, %s
zh_tw: 源位址改寫成 %s, %s

source: SNAT IP address
es: Dirección IP SNAT
uk: IP-адреса SNAT
zh_tw: SNAT IP 位址

source: SNAT port
es: Puerto SNAT
uk: Порт SNAT
zh_tw: SNAT 埠

source: Saturday
zh_tw: 星期六

source: Source IP address
es: Dirección IP origen
uk: IP-адреса джерела
zh_tw: 源 IP 位址

source: Source MAC address
es: Dirección MAC origen
uk: MAC-адреса джерела
zh_tw: 源 MAC 位址

source: Source NAT is a specific form of masquerading which allows fine grained control over the source IP used for outgoing traffic, for example to map multiple WAN addresses to internal subnets.
es: NAT origen es una forma específica de enmascaramiento que permite el control fino del origen IP que se usa en el tráfico de salida por ejemplo para dirigir múltiples direcciones WAN a las subredes internas.
uk: NAT джерела є специфічною формою маскування, яка дозволяє мати детальний контроль над IP джерела, що використовуються для вихідного трафіку, наприклад, для зіставлення кількох WAN-адрес внутрішнім підмережам.
zh_tw: Source NAT 是一種特殊形式的封包偽裝，它允許精細的控制傳出流量的源 IP，例如：將多個 WAN 位址對映到內部子網。

source: Source address
es: Dirección origen
uk: Адреса джерела
zh_tw: 源位址

source: Source port
es: Puerto origen
uk: Порт джерела
zh_tw: 源埠

source: Source zone
es: Zona origen
uk: Зона-джерело
zh_tw: 源區域

source: Start Date (yyyy-mm-dd)
zh_tw: 開始日期（yyyy-mm-dd）

source: Start Time (hh:mm:ss)
zh_tw: 開始時間（hh:mm:ss）

source: Stop Date (yyyy-mm-dd)
zh_tw: 停止日期（yyyy-mm-dd）

source: Stop Time (hh:mm:ss)
zh_tw: 停止時間（hh:mm:ss）

source: Sunday
zh_tw: 星期日

source: The firewall creates zones over your network interfaces to control network traffic flow.
es: El cortafuegos crea zonas sobre sus interfaces de red para controlar el flujo del tráfico.
uk: Брандмауер створює зони поверх ваших мережевих інтерфейсів для управління потоком мережевого трафіку.
zh_tw: 防火牆通過在網路介面上建立區域來控制網路流量。

source: The options below control the forwarding policies between this zone (%s) and other zones. <em>Destination zones</em> cover forwarded traffic <strong>originating from %q</strong>. <em>Source zones</em> match forwarded traffic from other zones <strong>targeted at %q</strong>. The forwarding rule is <em>unidirectional</em>, e.g. a forward from lan to wan does <em>not</em> imply a permission to forward from wan to lan as well.
es: Estas opciones controlan las políticas de traspaso entre esta zona (%s) y otras. <em>Las zonas origen</em> cubren el tráfico traspasado <strong>desde %q</strong>. <em>Las zonas origen</em> coinciden con el tráfico traspasado desde otras zonas <strong>dirigido a %q</strong>. La regla de traspaso es <em>unidireccional</em>, por ejemplo una regla de traspaso desde la LAN a la WAN <em>no</em> implica permiso para traspasar desde la WAN a la LAN también.
uk: Опції, наведені нижче, управляють політиками спрямовування між цією (%s) та іншими зонами. <em>Зони призначення</em> покриваються трафіком, що <strong>виходить з %q</strong>. <em>Зони-джерела</em> покриваються трафіком з інших зон, <strong>спрямованим на %q</strong>. Правила спрямування є <em>односпрямованим</em>, тобто, спрямування від LAN до WAN <em>не</em> означає, що є також дозвіл спрямовувати від WAN в LAN.
zh_tw: 以下選項可以控制區域（%s）和其它區域間的轉發規則。<em>目標區域</em>接收<strong>源自 %q</strong> 的轉發流量。<em>源區域</em>匹配從<strong>目標為 %q</strong> 的區域的需轉發流量。轉發規則的作用是<em>單向</em>的，例如：一條允許從 lan 到 wan 的轉發規則並不隱含有允許相反方向從 wan 到 lan 的流量轉發。

source: This page allows you to change advanced properties of the port forwarding entry. In most cases there is no need to modify those settings.
es: Propiedades avanzadas de la entrada "traspaso de puertos". No suele ser necesario modificar esta configuración.
uk: На цій сторінці можна змінити додаткові властивості елемента спрямовування портів. У більшості випадків змінювати ці параметри немає необхідності.
zh_tw: 本頁面可以更改埠轉發的高階設定。大多數情況下，不需要更改這些設定。

source: This page allows you to change advanced properties of the traffic rule entry, such as matched source and destination hosts.
es: Propiedades avanzadas de la entrada "reglas de tráfico", como coincidencias en puertos de origen y destino.
uk: На цій сторінці можна змінити додаткові властивості елемента правил трафіка, таких як відповідні параметри джерела та вузлів призначення.
zh_tw: 本頁面可以更改通訊規則的高階設定，比如：需匹配的源主機和目標主機。

source: This section defines common properties of %q. The <em>input</em> and <em>output</em> options set the default policies for traffic entering and leaving this zone while the <em>forward</em> option describes the policy for forwarded traffic between different networks within the zone. <em>Covered networks</em> specifies which available networks are members of this zone.
zh_tw: 本節定義 %q 的通用屬性，<em>入站資料</em>和<em>出站資料</em>選項用於設定此區域入站和出站流量的預設策略，<em>轉發</em>選項描述該區域內不同網路之間的流量轉發策略。<em>覆蓋網路</em>指定從屬於這個區域的網路。

source: Thursday
zh_tw: 星期四

source: Time in UTC
zh_tw: UTC 時間

source: To %s at %s on <var>this device</var>
es: A %s en %s por <var>este dispositivo</var>
uk: %s на %s <var>цього пристрою</var>
zh_tw: 到 %s 在 %s 位於<var>本裝置</var>

source: To %s in %s
es: A %s en %s
uk: %s у %s
zh_tw: 到 %s 位於 %s

source: To %s on <var>this device</var>
es: A %s por <var>este dispositivo</var>
uk: %s на <var>цього пристрою</var>
zh_tw: 到 %s 位於<var>本裝置</var>

source: To %s, %s in %s
es: A %s, %s en %s
uk: %s, %s у %s
zh_tw: 到 %s, %s 位於 %s

source: To source IP
es: A IP origen
uk: До IP джерела
zh_tw: 到源 IP

source: To source port
es: A puerto origen
uk: До порту джерела
zh_tw: 到源埠

source: Traffic Rules
es: Reglas de tráfico
uk: Правила трафіка
zh_tw: 通訊規則

source: Traffic rules define policies for packets traveling between different zones, for example to reject traffic between certain hosts or to open WAN ports on the router.
es: Las reglas de tráfico definen políticas para tramas que se mueven entre zonas diferentes, por ejemplo para rechazar tráfico entre ciertas máquinas o puertos WAN abiertos en el router.
uk: Правила трафіка визначають політику для пакетів, що пересилаються між різними зонами, наприклад, відхиляти трафік між певними вузлами або відкрити порти WAN на маршрутизаторі.
zh_tw: 通訊規則定義了不同區域間的資料包傳輸策略，例如：拒絕一些主機之間的通訊，開放路由器 WAN 上的埠。

source: Tuesday
zh_tw: 星期二

source: Via %s
es: Vía %s
uk: Через %s
zh_tw: 通過 %s

source: Via %s at %s
es: Vía %s a %s
uk: Через %s на %s
zh_tw: 通過 %s 在 %s

source: Wednesday
zh_tw: 星期三

source: Week Days
zh_tw: 星期

source: You may specify multiple by selecting "-- custom --" and then entering protocols separated by space.
es: Puede poner varios seleccionando "-- propio --" e introduciendo los protocolos separados por espacio.
uk: Ви можете вказати кілька протоколів, вибравши "-- додатково --", а потім увівши їх, розділяючи пробілами.
zh_tw: 您也可以選擇“--自定義--”來定義多個協議，在多個協議間需加空格。

source: Zone %q
es: Zona %q
uk: Зона %q
zh_tw: 區域 %q

source: Zone ⇒ Forwardings
es: Zona ⇒ Traspasos
uk: Зона ⇒ Спрямовування
zh_tw: 區域 ⇒ 轉發

source: Zones
es: Zonas
uk: Зони
zh_tw: 區域

source: accept
es: aceptar
uk: приймати
zh_tw: 接受

source: any
es: cualquiera
uk: будь-який
zh_tw: 所有

source: any host
es: cualquier máquina
uk: будь-який вузол
zh_tw: 所有主機

source: any router IP
es: cualquier router IP
uk: будь-який IP роутера
zh_tw: 所有路由 IP

source: any zone
es: cualquier zona
uk: будь-якій зоні
zh_tw: 所有區域

source: don't track
es: no seguir
uk: не відстеж.
zh_tw: 不跟蹤

source: drop
es: descartar
uk: опускати
zh_tw: 丟棄

source: reject
es: rechazar
uk: відкидати
zh_tw: 拒絕

source: traffic
es: tráfico
zh_tw: 通訊

source: Source NAT
es: NAT origen
uk: NAT джерела
